Ran Plan for dir: `.` workspace: `default`

<details><summary>Show Output</summary>

```diff
Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
+ create
~ update in-place

Terraform will perform the following actions:

  # aws_s3_bucket.test-bucket-3 will be created
+ resource "aws_s3_bucket" "test-bucket-3" {
      + acceleration_status         = (known after apply)
      + acl                         = (known after apply)
      + arn                         = (known after apply)
      + bucket                      = "my-tf-bucket-33333"
      + bucket_domain_name          = (known after apply)
      + bucket_prefix               = (known after apply)
      + bucket_regional_domain_name = (known after apply)
      + force_destroy               = false
      + hosted_zone_id              = (known after apply)
      + id                          = (known after apply)
      + object_lock_enabled         = (known after apply)
      + policy                      = (known after apply)
      + region                      = (known after apply)
      + request_payer               = (known after apply)
      + tags_all                    = (known after apply)
      + website_domain              = (known after apply)
      + website_endpoint            = (known after apply)
    }

  # module.atlantis-host.aws_instance.this[0] will be updated in-place
~ resource "aws_instance" "this" {
        id                                   = "i-0db64780594a99ed8"
        tags                                 = {
            "Environment" = "dev"
            "Name"        = "atlantis-host"
            "Terraform"   = "true"
        }
      ~ user_data                            = "e439931f8c38d8ceb969977af40d4964ef9336d8" -> "46ff23ac258f59b695eb890e03e2e85f1b058a81"
        # (34 unchanged attributes hidden)

        # (9 unchanged blocks hidden)
    }

  # module.atlantis-security-group.aws_security_group_rule.ingress_with_cidr_blocks[1] will be created
+ resource "aws_security_group_rule" "ingress_with_cidr_blocks" {
      + cidr_blocks              = [
          + "171.241.73.95/32",
        ]
      + description              = "atlantis-port"
      + from_port                = 4141
      + id                       = (known after apply)
      + prefix_list_ids          = []
      + protocol                 = "tcp"
      + security_group_id        = "sg-05d3a7814a7440a91"
      + security_group_rule_id   = (known after apply)
      + self                     = false
      + source_security_group_id = (known after apply)
      + to_port                  = 4141
      + type                     = "ingress"
    }

Plan: 2 to add, 1 to change, 0 to destroy.
```

* :arrow_forward: To **apply** this plan, comment:
    * `atlantis apply -d .`
* :put_litter_in_its_place: To **delete** this plan click [here](http://54.179.54.147:4141/lock?id=huylinh1997%252Fterraform-training%252F.%252Fdefault)
* :repeat: To **plan** this project again, comment:
    * `atlantis plan -d .`
</details>
Plan: 2 to add, 1 to change, 0 to destroy.

---
* :fast_forward: To **apply** all unapplied plans from this pull request, comment:
    * `atlantis apply`
* :put_litter_in_its_place: To delete all plans and locks for the PR, comment:
    * `atlantis unlock`